[NoCoverage] Statement mutation
BootCamps/DrWhoConsoleApp/App/Program.cs:10:13
     {
         static async Task Main(string[] args)
         {
-            Console.WriteLine("Starting Application...");
+            ;
             await RunAsync();
         }

[NoCoverage] Statement mutation
BootCamps/DrWhoConsoleApp/App/Program.cs:11:13
         static async Task Main(string[] args)
         {
             Console.WriteLine("Starting Application...");
-            await RunAsync();
+            ;
         }
 

[NoCoverage] Statement mutation
BootCamps/DrWhoConsoleApp/App/Program.cs:22:17
 
                 var serviceRunner = host.Services.GetService<IServiceRunner>();
 
-                Console.WriteLine("Starting application runner...");
+                ;
 
                 if (serviceRunner != null) await serviceRunner.Run();

[NoCoverage] String mutation
BootCamps/DrWhoConsoleApp/App/Program.cs:22:35
 
                 var serviceRunner = host.Services.GetService<IServiceRunner>();
 
-                Console.WriteLine("Starting application runner...");
+                Console.WriteLine("");
 
                 if (serviceRunner != null) await serviceRunner.Run();

[NoCoverage] Statement mutation
BootCamps/DrWhoConsoleApp/App/Program.cs:24:44
 
                 Console.WriteLine("Starting application runner...");
 
-                if (serviceRunner != null) await serviceRunner.Run();
+                if (serviceRunner != null) ;
             }
             catch (Exception e)

[NoCoverage] Equality mutation
BootCamps/DrWhoConsoleApp/App/Program.cs:24:21
 
                 Console.WriteLine("Starting application runner...");
 
-                if (serviceRunner != null) await serviceRunner.Run();
+                if (serviceRunner == null) await serviceRunner.Run();
             }
             catch (Exception e)

[NoCoverage] Statement mutation
BootCamps/DrWhoConsoleApp/App/Program.cs:28:17
             }
             catch (Exception e)
             {
-                Console.WriteLine(e);
+                ;
                 throw;
             }

[NoCoverage] Statement mutation
BootCamps/DrWhoConsoleApp/App/Program.cs:29:17
             catch (Exception e)
             {
                 Console.WriteLine(e);
-                throw;
+                ;
             }
         }
