[Killed] Block removal mutation
DrWhoConsoleApp/App/Services/ConsoleService.cs:7:5
 public class ConsoleService : IConsoleService
 {
     public string ReadLine()
-    {
-        return Console.ReadLine();
-    }
+    {}
 
     public void WriteLine(string? message)
killedBy: UnitTests.Services.ConsoleServiceTests.ReadLine_ShouldReadMessageFromConsole(auto<ConsoleService>,auto<TextReader>,auto<String>)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/ConsoleService.cs:13:9
 
     public void WriteLine(string? message)
     {
-        Console.WriteLine(message);
+        ;
     }
     public void Write(string message)
killedBy: UnitTests.Services.ConsoleServiceTests.WriteLine_ShouldWriteMessageToConsole(auto<ConsoleService>,auto<TextWriter>,auto<String>)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/ConsoleService.cs:17:9
     }
     public void Write(string message)
     {
-        Console.Write(message);
+        ;
     }
 }
killedBy: UnitTests.Services.ConsoleServiceTests.Write_ShouldWriteMessageToConsole(auto<ConsoleService>,auto<TextWriter>,auto<String>)
