[Killed] Block removal mutation
DrWhoConsoleApp/App/Services/DoctorService.cs:13:9
         private readonly IDoctorWhoContext _context;
 
         public DoctorService(IDoctorWhoContext context)
-        {
-            _context = context;
-        }
+        {}
 
         public IEnumerable<Doctor> GetAllDoctors()
killedBy: UnitTests.Services.DoctorServiceTests.AddDoctor_ShouldAddDoctorToDatabase(auto<DoctorWhoContext>,auto<Doctor>); UnitTests.Services.DoctorServiceTests.GetAllDoctors_ShouldReturnAllDoctors(auto<DoctorWhoContext>,auto<List`1>)

[Killed] Block removal mutation
DrWhoConsoleApp/App/Services/DoctorService.cs:18:9
         }
 
         public IEnumerable<Doctor> GetAllDoctors()
-        {
-            return _context
-                .Doctors
-                .Include(d => d.Episodes)
-                .ToList();
-        }
+        {}
 
         public void AddDoctor(Doctor doctor)
killedBy: UnitTests.Services.DoctorServiceTests.GetAllDoctors_ShouldReturnAllDoctors(auto<DoctorWhoContext>,auto<List`1>)

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/DoctorService.cs:27:13
 
         public void AddDoctor(Doctor doctor)
         {
-            _context.Doctors.Add(doctor);
+            ;
             _context.SaveChanges();
         }

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/DoctorService.cs:28:13
         public void AddDoctor(Doctor doctor)
         {
             _context.Doctors.Add(doctor);
-            _context.SaveChanges();
+            ;
         }
     }
