[Killed] Block removal mutation
DrWhoConsoleApp/App/Services/EpisodeService.cs:16:9
         private readonly ILogger<EpisodeService> _logger;
 
         public EpisodeService(IDoctorWhoContext context, ILogger<EpisodeService> logger)
-        {
-            _context = context;
-            _logger = logger;
-        }
+        {}
 
         public void AddEpisode(Episode episode)
killedBy: UnitTests.Services.EpisodeServiceTests.AddEpisode_ShouldAddEpisodeToDatabase(auto<DoctorWhoContext>,auto<Episode>,auto<Mock`1>); UnitTests.Services.EpisodeServiceTests.AddEpisode_ShouldNotBeAddedWhenExceptionIsThrown(auto<DoctorWhoContext>,auto<Episode>,auto<ListLogger`1>); UnitTests.Services.EpisodeServiceTests.GetAllEpisodes_ShouldReturnAllEpisodes(auto<DoctorWhoContext>,auto<List`1>,auto<Mock`1>)

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/EpisodeService.cs:25:17
         {
             try
             {
-                _context.Episodes.Add(episode);
+                ;
                 _context.SaveChanges();
             }

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/EpisodeService.cs:26:17
             try
             {
                 _context.Episodes.Add(episode);
-                _context.SaveChanges();
+                ;
             }
             catch (Exception ex)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/EpisodeService.cs:34:17
 
                 var message = $"Error occurred while adding a new episode with details: {episodeText}\n" +
                     $"Error: {ex.Message}";
-                _logger.Log(LogLevel.Error, message);
+                ;
             }
         }
killedBy: UnitTests.Services.EpisodeServiceTests.AddEpisode_ShouldNotBeAddedWhenExceptionIsThrown(auto<DoctorWhoContext>,auto<Episode>,auto<ListLogger`1>)

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/EpisodeService.cs:41:13
 
         public void RemoveEpisode(Episode episode)
         {
-            _context.Episodes.Remove(episode);
+            ;
             _context.SaveChanges();
         }

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/EpisodeService.cs:42:13
         public void RemoveEpisode(Episode episode)
         {
             _context.Episodes.Remove(episode);
-            _context.SaveChanges();
+            ;
         }
 

[Killed] Block removal mutation
DrWhoConsoleApp/App/Services/EpisodeService.cs:46:9
         }
 
         public IEnumerable<Episode> GetAllEpisodes()
-        {
-            return _context.Episodes
-                         .Include(e => e.Doctor)
-                         .Include(e => e.Author)
-                         .ToList();
-        }
+        {}
     }
 }
killedBy: UnitTests.Services.EpisodeServiceTests.GetAllEpisodes_ShouldReturnAllEpisodes(auto<DoctorWhoContext>,auto<List`1>,auto<Mock`1>)
