[NoCoverage] Boolean mutation
DrWhoConsoleApp/App/Services/ListLogger.cs:11:49
 
     public IDisposable BeginScope<TState>(TState state) => null;
 
-    public bool IsEnabled(LogLevel logLevel) => true;
+    public bool IsEnabled(LogLevel logLevel) => false;
 
     public void Log<TState>(LogLevel logLevel, EventId eventId, TState state, Exception exception, Func<TState, Exception, string> formatter)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/ListLogger.cs:15:9
 
     public void Log<TState>(LogLevel logLevel, EventId eventId, TState state, Exception exception, Func<TState, Exception, string> formatter)
     {
-        Logs.Add($"{logLevel}: {formatter(state, exception)}");
+        ;
     }
 }
killedBy: UnitTests.Services.EpisodeServiceTests.AddEpisode_ShouldNotBeAddedWhenExceptionIsThrown(auto<DoctorWhoContext>,auto<Episode>,auto<ListLogger`1>); UnitTests.Services.UserInterfaceServiceTests.Run_ShouldHandleInvalidChoice(auto<Mock`1>,auto<ListLogger`1>,auto<String>); UnitTests.Services.UserInterfaceServiceTests.Run_ShouldNotListMenuWhenConsoleThrowsException(auto<Mock`1>,auto<Mock`1>,auto<ListLogger`1>,auto<Exception>)
