[Killed] Block removal mutation
DrWhoConsoleApp/App/Services/ServiceRunner.cs:11:9
         private readonly IUserInterfaceService _userInterfaceService;
 
         public ServiceRunner(IUserInterfaceService userInterfaceService)
-        {
-            _userInterfaceService = userInterfaceService;
-        }
+        {}
 
         public async Task Run()
killedBy: UnitTests.Services.ServiceRunnerTests.Run_ShouldCallUserInterfaceServiceRun(auto<Mock`1>)

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/ServiceRunner.cs:18:13
         public async Task Run()
         {
             var stopwatch = new Stopwatch();
-            stopwatch.Start();
+            ;
 
             _userInterfaceService.Run();

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/ServiceRunner.cs:20:13
             var stopwatch = new Stopwatch();
             stopwatch.Start();
 
-            _userInterfaceService.Run();
+            ;
 
             // Diagnostics
killedBy: UnitTests.Services.ServiceRunnerTests.Run_ShouldCallUserInterfaceServiceRun(auto<Mock`1>)

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/ServiceRunner.cs:23:13
             _userInterfaceService.Run();
 
             // Diagnostics
-            stopwatch.Stop();
+            ;
             var elapsed_time = stopwatch.ElapsedMilliseconds;
             Console.WriteLine($"Elapse time in milliseconds: {elapsed_time}");

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/ServiceRunner.cs:25:13
             // Diagnostics
             stopwatch.Stop();
             var elapsed_time = stopwatch.ElapsedMilliseconds;
-            Console.WriteLine($"Elapse time in milliseconds: {elapsed_time}");
+            ;
         }
     }
