[Killed] Block removal mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:20:9
             IConsoleService consoleService,
             ILogger<IUserInterfaceService> logger
             )
-        {
-            _doctorService = doctorService;
-            _episodeService = episodeService;
-            _consoleService = consoleService;
-            _logger = logger;
-        }
+        {}
 
         public void Run()
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldAddNewDoctor_WhenChoiceIs3(auto<Mock`1>,auto<Mock`1>,auto<ListLogger`1>,auto<Doctor>); UnitTests.Services.UserInterfaceServiceTests.Run_ShouldExit_WhenChoiceIs4(auto<Mock`1>,auto<ListLogger`1>); UnitTests.Services.UserInterfaceServiceTests.Run_ShouldHandleInvalidChoice(auto<Mock`1>,auto<ListLogger`1>,auto<String>)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:33:21
             {
                 while (true)
                 {
-                    _consoleService.WriteLine("1. List doctors");
+                    ;
                     _consoleService.WriteLine("2. List episodes by Year");
                     _consoleService.WriteLine("3. Add a new doctor");
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldNotListMenuWhenConsoleThrowsException(auto<Mock`1>,auto<Mock`1>,auto<ListLogger`1>,auto<Exception>)

[Survived] String mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:33:47
             {
                 while (true)
                 {
-                    _consoleService.WriteLine("1. List doctors");
+                    _consoleService.WriteLine("");
                     _consoleService.WriteLine("2. List episodes by Year");
                     _consoleService.WriteLine("3. Add a new doctor");

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:34:21
                 while (true)
                 {
                     _consoleService.WriteLine("1. List doctors");
-                    _consoleService.WriteLine("2. List episodes by Year");
+                    ;
                     _consoleService.WriteLine("3. Add a new doctor");
                     _consoleService.WriteLine("4. Exit");
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldNotListMenuWhenConsoleThrowsException(auto<Mock`1>,auto<Mock`1>,auto<ListLogger`1>,auto<Exception>)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:35:21
                 {
                     _consoleService.WriteLine("1. List doctors");
                     _consoleService.WriteLine("2. List episodes by Year");
-                    _consoleService.WriteLine("3. Add a new doctor");
+                    ;
                     _consoleService.WriteLine("4. Exit");
                     _consoleService.Write("Enter your choice: ");
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldNotListMenuWhenConsoleThrowsException(auto<Mock`1>,auto<Mock`1>,auto<ListLogger`1>,auto<Exception>)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:36:21
                     _consoleService.WriteLine("1. List doctors");
                     _consoleService.WriteLine("2. List episodes by Year");
                     _consoleService.WriteLine("3. Add a new doctor");
-                    _consoleService.WriteLine("4. Exit");
+                    ;
                     _consoleService.Write("Enter your choice: ");
                     var choice = _consoleService.ReadLine();
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldNotListMenuWhenConsoleThrowsException(auto<Mock`1>,auto<Mock`1>,auto<ListLogger`1>,auto<Exception>)

[Survived] String mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:36:47
                     _consoleService.WriteLine("1. List doctors");
                     _consoleService.WriteLine("2. List episodes by Year");
                     _consoleService.WriteLine("3. Add a new doctor");
-                    _consoleService.WriteLine("4. Exit");
+                    _consoleService.WriteLine("");
                     _consoleService.Write("Enter your choice: ");
                     var choice = _consoleService.ReadLine();

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:37:21
                     _consoleService.WriteLine("2. List episodes by Year");
                     _consoleService.WriteLine("3. Add a new doctor");
                     _consoleService.WriteLine("4. Exit");
-                    _consoleService.Write("Enter your choice: ");
+                    ;
                     var choice = _consoleService.ReadLine();
 

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:40:21
                     _consoleService.Write("Enter your choice: ");
                     var choice = _consoleService.ReadLine();
 
-                    _consoleService.WriteLine("==============================================================================================================");
+                    ;
                     _consoleService.WriteLine(string.Empty);
 

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:41:21
                     var choice = _consoleService.ReadLine();
 
                     _consoleService.WriteLine("==============================================================================================================");
-                    _consoleService.WriteLine(string.Empty);
+                    ;
 
                     switch (choice)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:46:29
                     switch (choice)
                     {
                         case "1":
-                            ListDoctors();
+                            ;
                             break;
                         case "2":
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldListDoctors_WhenChoiceIs1(auto<Mock`1>,auto<Mock`1>,auto<List`1>,auto<ListLogger`1>)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:49:29
                             ListDoctors();
                             break;
                         case "2":
-                            ListEpisodesByYear();
+                            ;
                             break;
                         case "3":
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldListEpisodesByYear_WhenChoiceIs2(auto<Mock`1>,auto<Mock`1>,auto<List`1>,auto<ListLogger`1>)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:52:29
                             ListEpisodesByYear();
                             break;
                         case "3":
-                            AddNewDoctor();
+                            ;
                             break;
                         case "4":
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldAddNewDoctor_WhenChoiceIs3(auto<Mock`1>,auto<Mock`1>,auto<ListLogger`1>,auto<Doctor>)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:57:29
                         case "4":
                             return;
                         default:
-                            _consoleService.WriteLine("Invalid choice. Please try again.");
+                            ;
                             _logger.Log(LogLevel.Warning, $"Invalid choice ({choice}) entered by the user");
                             break;
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldHandleInvalidChoice(auto<Mock`1>,auto<ListLogger`1>,auto<String>)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:58:29
                             return;
                         default:
                             _consoleService.WriteLine("Invalid choice. Please try again.");
-                            _logger.Log(LogLevel.Warning, $"Invalid choice ({choice}) entered by the user");
+                            ;
                             break;
                     }
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldHandleInvalidChoice(auto<Mock`1>,auto<ListLogger`1>,auto<String>)

[Killed] String mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:58:59
                             return;
                         default:
                             _consoleService.WriteLine("Invalid choice. Please try again.");
-                            _logger.Log(LogLevel.Warning, $"Invalid choice ({choice}) entered by the user");
+                            _logger.Log(LogLevel.Warning, $"");
                             break;
                     }
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldHandleInvalidChoice(auto<Mock`1>,auto<ListLogger`1>,auto<String>)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:69:17
             catch (Exception ex)
             {
                 var errorText = $"An error occurred: {ex.Message}";
-                _logger.Log(LogLevel.Error, errorText);
+                ;
                 _consoleService.WriteLine(errorText);
             }
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldNotListMenuWhenConsoleThrowsException(auto<Mock`1>,auto<Mock`1>,auto<ListLogger`1>,auto<Exception>)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:70:17
             {
                 var errorText = $"An error occurred: {ex.Message}";
                 _logger.Log(LogLevel.Error, errorText);
-                _consoleService.WriteLine(errorText);
+                ;
             }
         }
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldNotListMenuWhenConsoleThrowsException(auto<Mock`1>,auto<Mock`1>,auto<ListLogger`1>,auto<Exception>)

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:77:13
         private void ListDoctors()
         {
             var doctors = _doctorService.GetAllDoctors();
-            _consoleService.WriteLine($"There are {doctors.Count()} doctors in the database");
+            ;
             int i = 0;
             foreach (var doctor in doctors)

[Survived] String mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:77:39
         private void ListDoctors()
         {
             var doctors = _doctorService.GetAllDoctors();
-            _consoleService.WriteLine($"There are {doctors.Count()} doctors in the database");
+            _consoleService.WriteLine($"");
             int i = 0;
             foreach (var doctor in doctors)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:82:17
             foreach (var doctor in doctors)
             {
                 i++;
-                _consoleService.WriteLine($"{i}. Doctor Name: {doctor.DoctorName}, born: {doctor.BirthDate}");
+                ;
             }
         }
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldListDoctors_WhenChoiceIs1(auto<Mock`1>,auto<Mock`1>,auto<List`1>,auto<ListLogger`1>)

[Survived] Boolean mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:88:22
 
         private void ListEpisodesByYear()
         {
-            bool v = false;
+            bool v = true;
             int yearInt = 0;
             int.TryParse("0", out yearInt);

[Killed] Boolean mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:92:20
             int yearInt = 0;
             int.TryParse("0", out yearInt);
 
-            while (true)
+            while (false)
             {
                 _consoleService.Write($"Please enter the year you want to list the episodes for: ");
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldListEpisodesByYear_WhenChoiceIs2(auto<Mock`1>,auto<Mock`1>,auto<List`1>,auto<ListLogger`1>)

[Killed] Negate expression
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:92:20
             int yearInt = 0;
             int.TryParse("0", out yearInt);
 
-            while (true)
+            while (!(true))
             {
                 _consoleService.Write($"Please enter the year you want to list the episodes for: ");
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldListEpisodesByYear_WhenChoiceIs2(auto<Mock`1>,auto<Mock`1>,auto<List`1>,auto<ListLogger`1>)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:94:17
 
             while (true)
             {
-                _consoleService.Write($"Please enter the year you want to list the episodes for: ");
+                ;
                 var year = _consoleService.ReadLine();
                 v = int.TryParse(year, out yearInt);
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldListEpisodesByYear_WhenChoiceIs2(auto<Mock`1>,auto<Mock`1>,auto<List`1>,auto<ListLogger`1>)

[Killed] String mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:94:39
 
             while (true)
             {
-                _consoleService.Write($"Please enter the year you want to list the episodes for: ");
+                _consoleService.Write($"");
                 var year = _consoleService.ReadLine();
                 v = int.TryParse(year, out yearInt);
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldListEpisodesByYear_WhenChoiceIs2(auto<Mock`1>,auto<Mock`1>,auto<List`1>,auto<ListLogger`1>)

[Timeout] Negate expression
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:98:21
                 var year = _consoleService.ReadLine();
                 v = int.TryParse(year, out yearInt);
 
-                if (v)
+                if (!(v))
                 {
                     break;

[NoCoverage] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:104:21
                 }
                 else
                 {
-                    _consoleService.WriteLine("Invalid year. Please try again.");
+                    ;
                     _logger.Log(LogLevel.Warning, $"Invalid year ({year}) entered by the user");
                 }

[NoCoverage] String mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:104:47
                 }
                 else
                 {
-                    _consoleService.WriteLine("Invalid year. Please try again.");
+                    _consoleService.WriteLine("");
                     _logger.Log(LogLevel.Warning, $"Invalid year ({year}) entered by the user");
                 }

[NoCoverage] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:105:21
                 else
                 {
                     _consoleService.WriteLine("Invalid year. Please try again.");
-                    _logger.Log(LogLevel.Warning, $"Invalid year ({year}) entered by the user");
+                    ;
                 }
             }

[Killed] Equality mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:111:71
 
             var allEpisodes = _episodeService.GetAllEpisodes();
             var episodes = allEpisodes
-                                .Where(x => x.EpisodeDate.HasValue && x.EpisodeDate.Value.Year == yearInt)
+                                .Where(x => x.EpisodeDate.HasValue && x.EpisodeDate.Value.Year != yearInt)
                                 .ToList();
 
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldListEpisodesByYear_WhenChoiceIs2(auto<Mock`1>,auto<Mock`1>,auto<List`1>,auto<ListLogger`1>)

[Survived] Logical mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:111:45
 
             var allEpisodes = _episodeService.GetAllEpisodes();
             var episodes = allEpisodes
-                                .Where(x => x.EpisodeDate.HasValue && x.EpisodeDate.Value.Year == yearInt)
+                                .Where(x => x.EpisodeDate.HasValue || x.EpisodeDate.Value.Year == yearInt)
                                 .ToList();
 

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:114:13
                                 .Where(x => x.EpisodeDate.HasValue && x.EpisodeDate.Value.Year == yearInt)
                                 .ToList();
 
-            _consoleService.WriteLine($"There is a total of {allEpisodes.Count()} episodes in the database");
+            ;
             _consoleService.WriteLine($"There are {episodes.Count()} episodes in the database broadcasted in {yearInt}");
             int i = 0;

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:115:13
                                 .ToList();
 
             _consoleService.WriteLine($"There is a total of {allEpisodes.Count()} episodes in the database");
-            _consoleService.WriteLine($"There are {episodes.Count()} episodes in the database broadcasted in {yearInt}");
+            ;
             int i = 0;
             foreach (var episode in episodes)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:120:17
             foreach (var episode in episodes)
             {
                 i++;
-                _consoleService.WriteLine($"{i}. Episode: {episode.Title}, Date: {episode.EpisodeDate}, Doctor: {episode.Doctor.DoctorName}");
+                ;
             }
         }
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldListEpisodesByYear_WhenChoiceIs2(auto<Mock`1>,auto<Mock`1>,auto<List`1>,auto<ListLogger`1>)

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:126:13
 
         private void AddNewDoctor()
         {
-            _consoleService.Write("Enter the new doctor's name:");
+            ;
             var doctorName = _consoleService.ReadLine();
             _consoleService.Write("Enter the new doctor's birthdate (yyyy-mm-dd):");

[Survived] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:128:13
         {
             _consoleService.Write("Enter the new doctor's name:");
             var doctorName = _consoleService.ReadLine();
-            _consoleService.Write("Enter the new doctor's birthdate (yyyy-mm-dd):");
+            ;
             var birthdate = _consoleService.ReadLine();
 

[Killed] Object initializer mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:133:33
 
             try
             {
-                var newDoctor = new Doctor { DoctorName = doctorName, BirthDate = DateOnly.Parse(birthdate) };
+                var newDoctor = new Doctor {};
                 _doctorService.AddDoctor(newDoctor);
                 _consoleService.WriteLine($"Doctor {newDoctor.DoctorName} with id {newDoctor.DoctorId} added");
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldAddNewDoctor_WhenChoiceIs3(auto<Mock`1>,auto<Mock`1>,auto<ListLogger`1>,auto<Doctor>)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:134:17
             try
             {
                 var newDoctor = new Doctor { DoctorName = doctorName, BirthDate = DateOnly.Parse(birthdate) };
-                _doctorService.AddDoctor(newDoctor);
+                ;
                 _consoleService.WriteLine($"Doctor {newDoctor.DoctorName} with id {newDoctor.DoctorId} added");
             }
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldAddNewDoctor_WhenChoiceIs3(auto<Mock`1>,auto<Mock`1>,auto<ListLogger`1>,auto<Doctor>)

[Killed] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:135:17
             {
                 var newDoctor = new Doctor { DoctorName = doctorName, BirthDate = DateOnly.Parse(birthdate) };
                 _doctorService.AddDoctor(newDoctor);
-                _consoleService.WriteLine($"Doctor {newDoctor.DoctorName} with id {newDoctor.DoctorId} added");
+                ;
             }
             catch (Exception ex)
killedBy: UnitTests.Services.UserInterfaceServiceTests.Run_ShouldAddNewDoctor_WhenChoiceIs3(auto<Mock`1>,auto<Mock`1>,auto<ListLogger`1>,auto<Doctor>)

[NoCoverage] String mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:140:21
             catch (Exception ex)
             {
                 var errorText = $"An error occurred while adding a new doctor with doctorName {doctorName} and birthdate {birthdate}" +
-                    $"\nError: {ex.Message}";
+                    $"";
                 _logger.Log(LogLevel.Error, errorText);
                 _consoleService.WriteLine(errorText);

[NoCoverage] Statement mutation
DrWhoConsoleApp/App/Services/UserInterfaceService.cs:141:17
             {
                 var errorText = $"An error occurred while adding a new doctor with doctorName {doctorName} and birthdate {birthdate}" +
                     $"\nError: {ex.Message}";
-                _logger.Log(LogLevel.Error, errorText);
+                ;
                 _consoleService.WriteLine(errorText);
             }
