[Survived] Statement mutation
BootCamps/DrWhoConsoleApp/App/StartUp.cs:20:21
             return Host.CreateDefaultBuilder()
                 .ConfigureAppConfiguration(app =>
                 {
-                    app.AddJsonFile("appSettings.json");
+                    ;
                 })
                 .ConfigureLogging((context, logging) =>

[Survived] Statement mutation
BootCamps/DrWhoConsoleApp/App/StartUp.cs:24:21
                 })
                 .ConfigureLogging((context, logging) =>
                 {
-                    logging.ClearProviders();
+                    ;
                     logging.AddConsole();
                     logging.SetMinimumLevel(LogLevel.Debug);

[Survived] Statement mutation
BootCamps/DrWhoConsoleApp/App/StartUp.cs:25:21
                 .ConfigureLogging((context, logging) =>
                 {
                     logging.ClearProviders();
-                    logging.AddConsole();
+                    ;
                     logging.SetMinimumLevel(LogLevel.Debug);
 

[Survived] Statement mutation
BootCamps/DrWhoConsoleApp/App/StartUp.cs:26:21
                 {
                     logging.ClearProviders();
                     logging.AddConsole();
-                    logging.SetMinimumLevel(LogLevel.Debug);
+                    ;
 
                     // Configure Serilog: logging would normally not go to a file but to a logging service like Azure App Insights

[Survived] Statement mutation
BootCamps/DrWhoConsoleApp/App/StartUp.cs:34:21
                         .WriteTo.File("log.txt", rollingInterval: RollingInterval.Day)
                         .CreateLogger();
 
-                    logging.AddSerilog();
+                    ;
                 })
                 .ConfigureServices(services =>

[Killed] Statement mutation
BootCamps/DrWhoConsoleApp/App/StartUp.cs:38:21
                 })
                 .ConfigureServices(services =>
                 {
-                    services.AddTransient<IServiceRunner, ServiceRunner>();
+                    ;
 
                     services.AddTransient(RegisterDbContext);
killedBy: UnitTests.StartUpTests.CreateHost_ShouldRegisterServices()

[Killed] Statement mutation
BootCamps/DrWhoConsoleApp/App/StartUp.cs:40:21
                 {
                     services.AddTransient<IServiceRunner, ServiceRunner>();
 
-                    services.AddTransient(RegisterDbContext);
+                    ;
 
                     services.AddTransient<IConsoleService, ConsoleService>();
killedBy: UnitTests.StartUpTests.CreateHost_ShouldRegisterServices()

[Killed] Statement mutation
BootCamps/DrWhoConsoleApp/App/StartUp.cs:42:21
 
                     services.AddTransient(RegisterDbContext);
 
-                    services.AddTransient<IConsoleService, ConsoleService>();
+                    ;
                     services.AddTransient<IDoctorService, DoctorService>();
                     services.AddTransient<IEpisodeService, EpisodeService>();
killedBy: UnitTests.StartUpTests.CreateHost_ShouldRegisterServices()

[Killed] Statement mutation
BootCamps/DrWhoConsoleApp/App/StartUp.cs:43:21
                     services.AddTransient(RegisterDbContext);
 
                     services.AddTransient<IConsoleService, ConsoleService>();
-                    services.AddTransient<IDoctorService, DoctorService>();
+                    ;
                     services.AddTransient<IEpisodeService, EpisodeService>();
                     services.AddTransient<IUserInterfaceService, UserInterfaceService>();
killedBy: UnitTests.StartUpTests.CreateHost_ShouldRegisterServices()

[Killed] Statement mutation
BootCamps/DrWhoConsoleApp/App/StartUp.cs:44:21
 
                     services.AddTransient<IConsoleService, ConsoleService>();
                     services.AddTransient<IDoctorService, DoctorService>();
-                    services.AddTransient<IEpisodeService, EpisodeService>();
+                    ;
                     services.AddTransient<IUserInterfaceService, UserInterfaceService>();
                 });
killedBy: UnitTests.StartUpTests.CreateHost_ShouldRegisterServices()

[Killed] Statement mutation
BootCamps/DrWhoConsoleApp/App/StartUp.cs:45:21
                     services.AddTransient<IConsoleService, ConsoleService>();
                     services.AddTransient<IDoctorService, DoctorService>();
                     services.AddTransient<IEpisodeService, EpisodeService>();
-                    services.AddTransient<IUserInterfaceService, UserInterfaceService>();
+                    ;
                 });
         }
killedBy: UnitTests.StartUpTests.CreateHost_ShouldRegisterServices()

[Killed] Block removal mutation
BootCamps/DrWhoConsoleApp/App/StartUp.cs:50:9
         }
 
         private static Func<IServiceProvider, IDoctorWhoContext> RegisterDbContext => provider =>
-        {
-            string connectionString = provider.GetService<IConfiguration>().GetValue<string>(Constants.AppSettings.DbConnectionString);
-
-            var options = new DbContextOptionsBuilder<DoctorWhoContext>()
-            .UseSqlServer(connectionString)
-            .Options;
-            return new DoctorWhoContext(options);
-        };
+        {};
     }
 }
killedBy: UnitTests.StartUpTests.CreateHost_ShouldRegisterServices()
